
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user  perpetual
Serial number: 401706320773
  Licensed to: Sebastian Kranz
               Ulm University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do "temp_do1.do", nostop 

. use "data.dta", clear
(Written by R.              )

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-1.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-1.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-1.dta
    saved

. sort group i

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-2.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-2.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-2.dta
    saved

. keep in 1/39
(1 observation deleted)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-3.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-3.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-3.dta
    saved

. list in 1/5

     +------------+
     |  i   group |
     |------------|
  1. | 10       A |
  2. | 13       A |
  3. | 16       A |
  4. | 19       A |
  5. | 20       A |
     +------------+

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-4.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-4.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-4.dta
    saved

. display _n



. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-5.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-5.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-5.dta
    saved

. by group: gen seq = _n

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-6.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-6.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-6.dta
    saved

. gen logi = log(i)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-7.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-7.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-7.dta
    saved

. gen sqrt_i = sqrt(i)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-8.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-8.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-8.dta
    saved

. gen group_num = cond(group=="A",1,cond(group=="B",2,3))

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-9.dta"
> , replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-9.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-9.dta
    saved

. egen mean_i_grp = mean(i), by(group)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-10.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-10.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-10.dta
    saved

. egen total_i = total(i)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-11.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-11.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-11.dta
    saved

. bysort group: egen rank_i = rank(i)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-12.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-12.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-12.dta
    saved

. gen flag = (i>20) if group=="A"
(26 missing values generated)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-13.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-13.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-13.dta
    saved

. replace flag = 0 if missing(flag)
(26 real changes made)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-14.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-14.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-14.dta
    saved

. keep if flag==1 | group=="B"
(19 observations deleted)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-15.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-15.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-15.dta
    saved

. drop if i>35
(4 observations deleted)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-16.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-16.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-16.dta
    saved

. collapse (mean) i (sum) total_i_sum = i, by(group)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-17.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-17.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-17.dta
    saved

. rename i mean_i_overall

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-18.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-18.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-18.dta
    saved

. expand 2 if group=="C"
(0 observations created)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-19.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-19.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-19.dta
    saved

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-20.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-20.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-20.dta
    saved

. encode group, gen(group_code)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-21.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-21.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-21.dta
    saved

. decode group_code, gen(group_str)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-22.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-22.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-22.dta
    saved

. sort group_code

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-23.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-23.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-23.dta
    saved

. tempfile t1

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-24.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-24.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-24.dta
    saved

. save "`t1'"
file /tmp/St108855.000001 saved as .dta format

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-25.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-25.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-25.dta
    saved

. keep if group_code==1
(1 observation deleted)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-26.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-26.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-26.dta
    saved

. merge 1:m group_code using "`t1'", keep(match master) nogenerate
(label group_code already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 1  
    -----------------------------------------

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-27.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-27.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-27.dta
    saved

. append using "`t1'"
(label group_code already defined)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-28.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-28.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-28.dta
    saved

. gen id = _n

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-29.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-29.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-29.dta
    saved

. bysort group_code (mean_i_overall): gen diff_mean = mean_i_overall - mean_i_o
> verall[_n-1]
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-30.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-30.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-30.dta
    saved

. recode group_code (1=10)(2=20)(3=30)
(3 changes made to group_code)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-31.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-31.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-31.dta
    saved

. drop if missing(mean_i_overall)
(0 observations deleted)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-32.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-32.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-32.dta
    saved

. order id group_code mean_i_overall

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-33.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-33.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-33.dta
    saved

. collapse (sum) sum_mean = mean_i_overall, by(group_code)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-34.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-34.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-34.dta
    saved

. egen total_sum = total(sum_mean)

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-35.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-35.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-35.dta
    saved

. gen proportion = sum_mean/total_sum

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-36.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-36.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-36.dta
    saved

. sort proportion

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-37.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-37.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-37.dta
    saved

. save "result_data.dta", replace
file result_data.dta saved

. save "/home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-38.dta
> ", replace emptyok
(file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-38.dta
    not found)
file /home/rstudio/aicoder/stata2r/aicoder_work/tests/do1/do_data/do1-38.dta
    saved

. 
end of do-file
