
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user  perpetual
Serial number: 401706320773
  Licensed to: Sebastian Kranz
               Ulm University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do "temp_do2.do", nostop 

. use "test_data.dta", clear
(Written by R.              )

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-1.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-1.dta saved

. generate value1_log = log(value1)
(5 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-2.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-2.dta saved

. generate value2_squared = value2^2
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-3.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-3.dta saved

. generate int_value1 = int(value1) if !missing(value1)
(5 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-4.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-4.dta saved

. generate rounded_value1 = round(value1, 0.1) if !missing(value1)
(5 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-5.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-5.dta saved

. generate random_uniform_draw = runiform()

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-6.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-6.dta saved

. generate id_plus_value2 = id + value2 if value2 < 7 & !missing(value2)
(9 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-7.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-7.dta saved

. replace value1_log = 0 if missing(value1_log) & !missing(value1)
(0 real changes made)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-8.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-8.dta saved

. replace value1 = value1 * 1.5 if group_orig == "Alpha" & !missing(value1) & !
> missing(group_orig)
(15 real changes made)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-9.dta", replac
> e emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-9.dta saved

. gen group_clean = strtrim(stritrim(lower(group_orig)))

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-10.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-10.dta saved

. replace group_clean = "unknown" if missing(group_clean)
(0 real changes made)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-11.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-11.dta saved

. gen group_abbr = substr(group_clean, 1, 3) if group_clean != "unknown"

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-12.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-12.dta saved

. gen contact_info = group_clean + ":" + num_str

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-13.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-13.dta saved

. gen str_len_group = strlen(group_clean)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-14.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-14.dta saved

. replace contact_info = subinstr(contact_info, "beta", "delta", 1) if strpos(c
> ontact_info, "beta") > 0
(20 real changes made)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-15.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-15.dta saved

. egen mean_overall_value1 = mean(value1)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-16.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-16.dta saved

. egen sd_overall_value1 = sd(value1)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-17.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-17.dta saved

. egen total_value2_by_group = total(value2), by(group_clean)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-18.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-18.dta saved

. egen median_value1_by_group = median(value1), by(group_clean)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-19.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-19.dta saved

. egen group_numeric_id = group(group_clean)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-20.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-20.dta saved

. egen tag_first_in_group = tag(group_clean)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-21.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-21.dta saved

. egen count_obs_in_group = count(id), by(group_clean)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-22.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-22.dta saved

. egen rank_value1_in_group = rank(value1), by(group_clean) fieldstrustmissings
option fieldstrustmissings not allowed
r(198);

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-23.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-23.dta saved

. egen row_total_v1_v2 = rowtotal(value1 value2)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-24.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-24.dta saved

. egen row_mean_v1_v2 = rowmean(value1 value2)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-25.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-25.dta saved

. egen concat_group_num = concat(group_clean num_str)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-26.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-26.dta saved

. summarize value2, meanonly

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-27.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-27.dta saved

. gen value2_dev_from_mean = value2 - r(mean) if !missing(value2) & r(mean) != 
> .
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-28.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-28.dta saved

. gen obs_date = date(date_str, "YMD", 2050)
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-29.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-29.dta saved

. format obs_date %tdCY-N-D

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-30.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-30.dta saved

. gen obs_year = year(obs_date) if !missing(obs_date)
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-31.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-31.dta saved

. gen obs_month = month(obs_date) if !missing(obs_date)
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-32.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-32.dta saved

. gen obs_day = day(obs_date) if !missing(obs_date)
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-33.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-33.dta saved

. gen obs_quarter = qofd(obs_date) if !missing(obs_date)
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-34.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-34.dta saved

. gen days_since_2021_start = obs_date - mdy(1,1,2021) if !missing(obs_date)
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-35.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-35.dta saved

. gen is_weekend_day = (dow(obs_date) == 0 | dow(obs_date) == 6) if !missing(ob
> s_date)
(2 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-36.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-36.dta saved

. destring num_str, generate(num_val_from_str) ignore("error")
num_str: all characters numeric; num_val_from_str generated as int

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-37.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-37.dta saved

. replace num_val_from_str = 0 if missing(num_val_from_str)
(0 real changes made)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-38.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-38.dta saved

. destring mixed_var, generate(mixed_val_num) force
mixed_var: contains nonnumeric characters; mixed_val_num generated as byte
(12 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-39.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-39.dta saved

. gen mixed_var_as_str = string(mixed_val_num) if !missing(mixed_val_num)
(12 missing values generated)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-40.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-40.dta saved

. encode group_clean, generate(group_code_num)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-41.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-41.dta saved

. label define group_label_map 1 "alpha" 2 "beta" 3 "gamma" 4 "unknown", replac
> e

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-42.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-42.dta saved

. label values group_code_num group_label_map

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-43.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-43.dta saved

. label variable group_code_num "Numeric code for cleaned group"

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-44.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-44.dta saved

. decode group_code_num, generate(group_from_decode)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-45.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-45.dta saved

. recode value2 (0/1=1 "Very Low") (2/4=2 "Low-Mid") (nonmissing=3 "High") (mis
> sing = .a), gen(value2_cat_str)
(46 differences between value2 and value2_cat_str)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-46.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-46.dta saved

. recode value2 (0/1=1) (2/4=2) (nonmissing=3) (missing = 99), gen(value2_cat_n
> um)
(46 differences between value2 and value2_cat_num)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-47.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-47.dta saved

. sort group_clean value1

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-48.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-48.dta saved

. gsort -value1 +id

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-49.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-49.dta saved

. drop random_uniform_draw int_value1 rounded_value1

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-50.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-50.dta saved

. keep if value2 < 12 | missing(value2)
(0 observations deleted)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-51.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-51.dta saved

. keep if _n <= 40
(10 observations deleted)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-52.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-52.dta saved

. drop if mod(id, 4) == 0 & value1 > 50
(4 observations deleted)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-53.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-53.dta saved

. keep id group_orig value1 value1_log value2 value2_squared group_clean obs_da
> te num_val_from_str value2_cat_str mean_overall_value1 total_value2_by_group 
> group_code_num

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-54.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-54.dta saved

. rename group_orig orig_group_name

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-55.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-55.dta saved

. rename value1_log log_val1

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-56.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-56.dta saved

. order id orig_group_name group_clean log_val1

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-57.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-57.dta saved

. gen high_value1_indicator = (value1 > mean_overall_value1) if !missing(value1
> ) & !missing(mean_overall_value1)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-58.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-58.dta saved

. gen observation_seq_num = _n

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-59.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-59.dta saved

. gen total_obs_count = _N

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-60.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-60.dta saved

. replace value1 = cond(missing(value1), mean_overall_value1, cond(value1 > 60,
>  value1*1.05, value1*0.95))
(36 real changes made)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-61.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-61.dta saved

. compress
  variable id was long now byte
  variable value2 was long now byte
  variable value2_squared was float now byte
  variable total_value2_by_group was float now byte
  variable obs_date was float now int
  variable group_code_num was long now byte
  variable value2_cat_str was long now byte
  variable high_value1_indicator was float now byte
  variable observation_seq_num was float now byte
  variable total_obs_count was float now byte
  (1,044 bytes saved)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-62.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-62.dta saved

. save "main_data_temp.dta", replace
file main_data_temp.dta saved

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-63.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-63.dta saved

. use "extra_data.dta", clear
(Written by R.              )

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-64.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-64.dta saved

. rename category_code extra_cat_code

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-65.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-65.dta saved

. sort id

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-66.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-66.dta saved

. save "extra_data_temp.dta", replace
file extra_data_temp.dta saved

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-67.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-67.dta saved

. use "main_data_temp.dta", clear
(Written by R.              )

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-68.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-68.dta saved

. sort id

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-69.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-69.dta saved

. merge 1:1 id using "extra_data_temp.dta", nogen
(variable id was byte, now long to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            40
        from master                        23  
        from using                         17  

    Matched                                13  
    -----------------------------------------

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-70.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-70.dta saved

. append using "append_data.dta", generate(appended_flag)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-71.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-71.dta saved

. preserve

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-72.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-72.dta saved

. keep if id <= 20 & !missing(value1) & !missing(value2) & !missing(group_code_
> num)
(51 observations deleted)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-73.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-73.dta saved

. drop if missing(id)
(0 observations deleted)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-74.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-74.dta saved

. bysort id group_code_num: gen time_var_for_reshape = 100 + _n

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-75.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-75.dta saved

. keep if time_var_for_reshape <= 102
(0 observations deleted)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-76.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-76.dta saved

. duplicates drop id group_code_num time_var_for_reshape, force

Duplicates in terms of id group_code_num time_var_for_reshape

(0 observations are duplicates)

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-77.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-77.dta saved

. reshape wide value1 value2, i(id group_code_num) j(time_var_for_reshape)
(j = 101)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               12   ->   12          
Number of variables                  21   ->   20          
j variable (1 values)time_var_for_reshape ->   (dropped)
xij variables:
                                 value1   ->   value1101
                                 value2   ->   value2101
-----------------------------------------------------------------------------

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-78.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-78.dta saved

. reshape long value1 value2, i(id group_code_num) j(time_var_reverted)
(j = 101)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations               12   ->   12          
Number of variables                  20   ->   21          
j variable (1 values)                     ->   time_var_reverted
xij variables:
                              value1101   ->   value1
                              value2101   ->   value2
-----------------------------------------------------------------------------

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-79.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-79.dta saved

. restore

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-80.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-80.dta saved

. label data "Comprehensive Test Data - Final Version"

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-81.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-81.dta saved

. save "result_data.dta"
file result_data.dta already exists
r(602);

. save "/home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-82.dta", repla
> ce emptyok
file /home/rstudio/aicoder/stata2r/inst/cases/do2/do_data/do2-82.dta saved

. 
end of do-file
